type ISubwayStation = string;
interface ISubwayLine {
    id: string;
    name: string;
    color: string;
    stations: ISubwayStation[];
}
interface ISubwayCity {
    city: string;
    lines: ISubwayLine[];
}

export const subwaySpb: ISubwayCity = {
    city: "Санкт-Петербург",
    lines: [
        {
            id: "line1",
            name: "Линия 1",
            color: "#D70138",
            stations: [
                "Девяткино",
                "Гражданский Проспект",
                "Академическая",
                "Политехническая",
                "Площадь Мужества",
                "Лесная",
                "Выборгская",
                "Площадь Ленина",
                "Чернышевская",
                "Площадь Восстания",
                "Владимирская",
                "Пушкинская",
                "Технологический Институт-1",
                "Балтийская",
                "Нарвская",
                "Кировский Завод",
                "Автово",
                "Ленинский Проспект",
                "Проспект Ветеранов",
            ],
        },
        {
            id: "line2",
            name: "Линия 2",
            color: "#0079CA",
            stations: [
                "Парнас",
                "Проспект Просвещения",
                "Озерки",
                "Удельная",
                "Пионерская",
                "Чёрная Речка",
                "Петроградская",
                "Горьковская",
                "Невский Проспект",
                "Сенная Площадь",
                "Технологический Институт-2",
                "Фрунзенская",
                "Московские Ворота",
                "Электросила",
                "Парк Победы",
                "Московская",
                "Звёздная",
                "Купчино",
            ],
        },
        {
            id: "line3",
            name: "Линия 3",
            color: "#019C47",
            stations: [
                "Беговая",
                "Зенит",
                "Приморская",
                "Василеостровская",
                "Гостиный Двор",
                "Маяковская",
                "Площадь Александра Невского-1",
                "Елизаровская",
                "Ломоносовская",
                "Пролетарская",
                "Обухово",
                "Рыбацкое",
            ],
        },
        {
            id: "line4",
            name: "Линия 4",
            color: "#EB7220",
            stations: [
                "Спасская",
                "Достоевская",
                "Лиговский Проспект",
                "Площадь Александра Невского-2",
                "Новочеркасская",
                "Ладожская",
                "Проспект Большевиков",
                "Улица Дыбенко",
            ],
        },
        {
            id: "line5",
            name: "Линия 5",
            color: "#6D2781",
            stations: [
                "Комендантский Проспект",
                "Старая Деревня",
                "Крестовский Остров",
                "Чкаловская",
                "Спортивная",
                "Адмиралтейская",
                "Садовая",
                "Звенигородская",
                "Обводный Канал",
                "Волковская",
                "Бухарестская",
                "Международная",
                "Проспект Славы",
                "Дунайская",
                "Шушары",
            ],
        },
    ],
};
